{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<PAD>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": ""
    },
    "behavior": "Removed",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<PAD>": 0,
      "-": 1,
      "A": 2,
      "C": 3,
      "D": 4,
      "E": 5,
      "F": 6,
      "G": 7,
      "H": 8,
      "I": 9,
      "K": 10,
      "L": 11,
      "M": 12,
      "N": 13,
      "P": 14,
      "Q": 15,
      "R": 16,
      "S": 17,
      "T": 18,
      "V": 19,
      "W": 20,
      "Y": 21,
      "[": 22,
      "]": 23
    },
    "unk_token": "<unk>"
  }
}