{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "_",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "?",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": ""
    },
    "behavior": "Removed",
    "invert": false
  },
  "post_processor": null,
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "type": "WordLevel",
    "vocab": {
      "_": 0,
      "?": 1,
      "-": 2,
      "A": 3,
      "C": 4,
      "D": 5,
      "E": 6,
      "F": 7,
      "G": 8,
      "H": 9,
      "I": 10,
      "K": 11,
      "L": 12,
      "M": 13,
      "N": 14,
      "P": 15,
      "Q": 16,
      "R": 17,
      "S": 18,
      "T": 19,
      "V": 20,
      "W": 21,
      "Y": 22,
      "[": 23,
      "]": 24
    },
    "unk_token": "?"
  }
}